In [ ]:
###DROPPIMG COLUMNS
#DROPPING ROWS
#VARIOUS PARAMETERS
#HANDLING MISSING VALUES BY MEANS,MEDIAN MODE

In [15]:
from pyspark.sql import SparkSession

In [16]:
spark=SparkSession.builder.appName('Practice').getOrCreate()

In [17]:
df_pyspark=spark.read.csv('test2.csv',header=True,inferSchema=True)

In [18]:
df_pyspark.show()

+------+----+----------+------+
|  Name| age|experience|salary|
+------+----+----------+------+
| Krish|  31|        10| 30000|
|    su|  30|         8| 25000|
| sunny|  29|         4| 20000|
|  paul|  24|         3| 15000|
|harsha|  21|         1| 20000|
| shubh|  23|         2| 18000|
|mahesh|NULL|      NULL| 40000|
|  NULL|  34|        10| 38000|
|  NULL|  36|      NULL|  NULL|
+------+----+----------+------+

In [19]:
#DROP COLUMN
df_pyspark.drop('Name').show()

+----+----------+------+
| age|experience|salary|
+----+----------+------+
|  31|        10| 30000|
|  30|         8| 25000|
|  29|         4| 20000|
|  24|         3| 15000|
|  21|         1| 20000|
|  23|         2| 18000|
|NULL|      NULL| 40000|
|  34|        10| 38000|
|  36|      NULL|  NULL|
+----+----------+------+

In [20]:
df_pyspark.na.drop().show()#drop all the rows where null values are present

+------+---+----------+------+
|  Name|age|experience|salary|
+------+---+----------+------+
| Krish| 31|        10| 30000|
|    su| 30|         8| 25000|
| sunny| 29|         4| 20000|
|  paul| 24|         3| 15000|
|harsha| 21|         1| 20000|
| shubh| 23|         2| 18000|
+------+---+----------+------+

In [21]:
df_pyspark.na.drop(how='any').show()#drop all the rows where null values are present

+------+---+----------+------+
|  Name|age|experience|salary|
+------+---+----------+------+
| Krish| 31|        10| 30000|
|    su| 30|         8| 25000|
| sunny| 29|         4| 20000|
|  paul| 24|         3| 15000|
|harsha| 21|         1| 20000|
| shubh| 23|         2| 18000|
+------+---+----------+------+

In [22]:
df_pyspark.na.drop(how='all').show()#drop all the rows where null values are present

+------+----+----------+------+
|  Name| age|experience|salary|
+------+----+----------+------+
| Krish|  31|        10| 30000|
|    su|  30|         8| 25000|
| sunny|  29|         4| 20000|
|  paul|  24|         3| 15000|
|harsha|  21|         1| 20000|
| shubh|  23|         2| 18000|
|mahesh|NULL|      NULL| 40000|
|  NULL|  34|        10| 38000|
|  NULL|  36|      NULL|  NULL|
+------+----+----------+------+

In [23]:
df_pyspark.na.drop(how='any',thresh=2).show()#aleast 2 non null values should be present

+------+----+----------+------+
|  Name| age|experience|salary|
+------+----+----------+------+
| Krish|  31|        10| 30000|
|    su|  30|         8| 25000|
| sunny|  29|         4| 20000|
|  paul|  24|         3| 15000|
|harsha|  21|         1| 20000|
| shubh|  23|         2| 18000|
|mahesh|NULL|      NULL| 40000|
|  NULL|  34|        10| 38000|
+------+----+----------+------+

In [24]:
df_pyspark.na.drop(how='any',subset=['Age']).show()#drop all the rows where null values are present in age column

+------+---+----------+------+
|  Name|age|experience|salary|
+------+---+----------+------+
| Krish| 31|        10| 30000|
|    su| 30|         8| 25000|
| sunny| 29|         4| 20000|
|  paul| 24|         3| 15000|
|harsha| 21|         1| 20000|
| shubh| 23|         2| 18000|
|  NULL| 34|        10| 38000|
|  NULL| 36|      NULL|  NULL|
+------+---+----------+------+

In [25]:
df_pyspark.na.fill('Missing Values',['Name','Age']).show()#fill the missing values with missing values

+--------------+----+----------+------+
|          Name| age|experience|salary|
+--------------+----+----------+------+
|         Krish|  31|        10| 30000|
|            su|  30|         8| 25000|
|         sunny|  29|         4| 20000|
|          paul|  24|         3| 15000|
|        harsha|  21|         1| 20000|
|         shubh|  23|         2| 18000|
|        mahesh|NULL|      NULL| 40000|
|Missing Values|  34|        10| 38000|
|Missing Values|  36|      NULL|  NULL|
+--------------+----+----------+------+

In [26]:
df_pyspark.na.fill('Missing Values').show()

+--------------+----+----------+------+
|          Name| age|experience|salary|
+--------------+----+----------+------+
|         Krish|  31|        10| 30000|
|            su|  30|         8| 25000|
|         sunny|  29|         4| 20000|
|          paul|  24|         3| 15000|
|        harsha|  21|         1| 20000|
|         shubh|  23|         2| 18000|
|        mahesh|NULL|      NULL| 40000|
|Missing Values|  34|        10| 38000|
|Missing Values|  36|      NULL|  NULL|
+--------------+----+----------+------+

In [27]:
#mean
from pyspark.ml.feature import Imputer
imputer=Imputer(
    inputCols=['age','experience','salary'],
    outputCols=["{}_imputed".format(c) for c in ['age','experience','salary']]
).setStrategy("mean")

In [28]:
imputer.fit(df_pyspark).transform(df_pyspark).show()

+------+----+----------+------+-----------+------------------+--------------+
|  Name| age|experience|salary|age_imputed|experience_imputed|salary_imputed|
+------+----+----------+------+-----------+------------------+--------------+
| Krish|  31|        10| 30000|         31|                10|         30000|
|    su|  30|         8| 25000|         30|                 8|         25000|
| sunny|  29|         4| 20000|         29|                 4|         20000|
|  paul|  24|         3| 15000|         24|                 3|         15000|
|harsha|  21|         1| 20000|         21|                 1|         20000|
| shubh|  23|         2| 18000|         23|                 2|         18000|
|mahesh|NULL|      NULL| 40000|         28|                 5|         40000|
|  NULL|  34|        10| 38000|         34|                10|         38000|
|  NULL|  36|      NULL|  NULL|         36|                 5|         25750|
+------+----+----------+------+-----------+------------------+--------------+